Revit 2027 API
PushButton.ClassName Property
The name of the class containing the implementation for the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ClassName { get; set; }
Public Property ClassName As String
	Get
	Set
public:
property String^ ClassName {
	String^ get ();
	void set (String^ value);
}
member ClassName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException | Thrown when setting the value to null.
ArgumentException | Thrown when setting the value to an empty string.
InvalidOperationException | Thrown when setting the value to a ToggleButton which is not initialized with an external command.
Remarks
The class name which implements the interface IExternalCommand.
See Also
Reference
PushButton Class
Autodesk.Revit.UI Namespace